CalculationRegisters/Начисления.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.12">
	<CalculationRegister>
		<Properties>
			<Name>Начисления</Name>
			<Periodicity>Month</Periodicity>
			<ActionPeriod>true</ActionPeriod>
			<BasePeriod>true</BasePeriod>
			<Schedule>InformationRegister.ГрафикиРаботыПоВидамВремени</Schedule>
			<ScheduleValue>InformationRegister.ГрафикиРаботыПоВидамВремени.Resource.ОсновноеЗначение</ScheduleValue>
			<ScheduleDate>InformationRegister.ГрафикиРаботыПоВидамВремени.Dimension.Дата</ScheduleDate>
			<ChartOfCalculationTypes>ChartOfCalculationTypes.Начисления</ChartOfCalculationTypes>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Результат</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ОтработаноДней</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>7</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ОтработаноЧасов</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>7</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>РезультатВТомЧислеЗаСчетФБ</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>РанееНачислено</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>РезультатФСС</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ГрафикРаботы</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
						<v8:Type>cfg:CatalogRef.ГрафикиРаботыСотрудников</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидУчетаВремени</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыИспользованияРабочегоВремени</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВремяВЧасах</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВремяВЦеломЗаПериод</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ГрафикРаботыНорма</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
						<v8:Type>cfg:CatalogRef.ГрафикиРаботыСотрудников</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ФиксСтрока</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ФиксЗаполнение</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ФиксРасчетВремени</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ФиксРасчет</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ФиксСторно</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РасчетнаяБазаЗаЕдиницуНормыВремени</Name>
					<Comment>Расчетная база на единицу нормы времени для расчета сторно-записей</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИдентификаторСтроки</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>7</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПериодРегистрацииВремени</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПериодРегистрацииНормыВремени</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДоляРезультата</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>7</v8:Digits>
							<v8:FractionDigits>6</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Месяц</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДокументОснование</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ОснованиеНачисления</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СторнируемыйДокумент</Name>
					<Comment>Документ, который зарегистрировал сторнируемое начисление</Comment>
					<Type>
						<v8:TypeSet>cfg:DefinedType.СторнируемыйДокумент</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ГоловнойСотрудник</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОбщийГрафик</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ГрафикиРаботыСотрудников</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Перерасчет</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РассчитыватьПоРазовымНачислениямДокумента</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РегистраторРазовогоНачисления</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.РегистраторРазовогоНачисления</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИсходныйДокумент</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.СторнируемыйДокумент</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Сотрудник</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
					<BaseDimension>true</BaseDimension>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ФизическоеЛицо</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
					<BaseDimension>false</BaseDimension>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ГоловнаяОрганизация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
					<BaseDimension>false</BaseDimension>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СторноТекущегоПериода</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ДокументИсправляемыйВТекущемПериоде</v8:TypeSet>
					</Type>
					<BaseDimension>false</BaseDimension>
				</Properties>
			</Dimension>
		</ChildObjects>
	</CalculationRegister>
</MetaDataObject>

Enums/ВидыЗанятости.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.12">
	<Enum>
		<Properties>
			<Name>ВидыЗанятости</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ОсновноеМестоРаботы</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Совместительство</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВнутреннееСовместительство</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Подработка</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Catalogs/Сотрудники.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.12">
	<Catalog>
		<Properties>
			<Name>Сотрудники</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ФизическоеЛицо</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ГоловнаяОрганизация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТекущийПроцентСевернойНадбавки</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВАрхиве</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УточнениеНаименования</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>40</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ГоловнойСотрудник</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтудентРаботающийВСтудотряде</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ДополнительныеРеквизиты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Свойство</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ДополнительныеРеквизитыИСведения</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТекстоваяСтрока</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>УдалитьНаборыЗначенийДоступа</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>НомерНабора</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЗначениеДоступа</Name>
							<Comment>Незаполненные значения нужно допустить, чтобы избежать ошибок при записи проверяемых объектов</Comment>
							<Type>
								<v8:TypeSet>cfg:DefinedType.ЗначениеДоступа</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Чтение</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Изменение</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Уточнение</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ИдентификаторыОбъектовМетаданных</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

CalculationRegisters/Начисления/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

#Область ДляВызоваИзДругихПодсистем

// Возвращает объект ОписаниеТипов, соответствующий типу поля Регистратор набора записей регистра расчета.
// 
// Возвращаемое значение:
//  ОписаниеТипов - описание типов поля Регистратор
//
Функция ОписаниеТиповПоляРегистратор() Экспорт
	Возврат РегистрыРасчета.Начисления.СоздатьНаборЗаписей().Отбор.Регистратор.ТипЗначения;
КонецФункции

// СтандартныеПодсистемы.УправлениеДоступом

// См. УправлениеДоступомПереопределяемый.ПриЗаполненииСписковСОграничениемДоступа.
Процедура ПриЗаполненииОграниченияДоступа(Ограничение) Экспорт
	Ограничение.Текст =
	"РазрешитьЧтениеИзменение
	|ГДЕ
	|	ЗначениеРазрешено(Организация)
	|	И ЗначениеРазрешено(ФизическоеЛицо)";
КонецПроцедуры

// Конец СтандартныеПодсистемы.УправлениеДоступом

#КонецОбласти

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

#Область ОбработчикиПравилРегистрации

// См. ЗарплатаКадрыРасширенныйСинхронизацияДанных.ШаблонОбработчика
Процедура ПриЗаполненииНастроекОбработчиковПравилРегистрации(Настройки) Экспорт
	ЗарплатаКадрыРасширенныйСинхронизацияДанных.ДляРегистраПодчиненногоРегистратору(Настройки);
КонецПроцедуры

#КонецОбласти

Процедура ЗапланироватьПреобразованиеСторноТекущегоПериода(НаборЗаписей, ИсправленныйДокумент) Экспорт
	
	// Преобразование строк выполняется перед записью набора.
	// См. РегистрыРасчета.Начисления.МодульНабораЗаписей Процедура ПреобразоватьСторноСтрокиТекущегоПериода.
	НаборЗаписей.ДополнительныеСвойства.Вставить("ЕстьПерерасчетыПриИсправленииВТекущемПериоде", Истина);
	НаборЗаписей.ДополнительныеСвойства.Вставить("ИсправленныйДокумент", ИсправленныйДокумент);
	
КонецПроцедуры

// Получает результирующий период действия по параметрам отбора
//
// Параметры:
//  Отборы       - Структура, см. ЗарплатаКадрыОбщиеНаборыДанных.ДобавитьВКоллекциюОтбор - параметры и их значения для
//                                                                                         получения ФПД.
//  ОтборыДляФПД - Структура, см. ЗарплатаКадрыОбщиеНаборыДанных.ДобавитьВКоллекциюОтбор - параметры, формирующие
//                                                                                         условия для ФПД.
// 
// Возвращаемое значение:
//   ТаблицаЗначений
//
Функция РезультирующийПериодДействия(Отборы, ОтборыДляФПД = Неопределено) Экспорт
	
	Реквизиты = "*";
	
	РПД = ЗарплатаКадрыРасширенный.РезультирующийПериодДействия(Метаданные.РегистрыРасчета.Начисления, Отборы, 
		Реквизиты, ОтборыДляФПД);
		
	ПараметрыОтбора = Новый Структура;
	ПараметрыОтбора.Вставить("Сторно", Ложь);
	ПараметрыОтбора.Вставить("ФиксСторно", Ложь);
	ПараметрыОтбора.Вставить("СторноТекущегоПериода", Неопределено);

	Результат = РПД.Скопировать(ПараметрыОтбора);
	
	Возврат Результат;
	
КонецФункции

// Формирует временную таблицу результирующих периодов действия (РПД).
//
// Параметры:
//  МенеджерВременныхТаблиц - МенеджерВременныхТаблиц - Менеджер ВТ в который помещается результат.
//  Отборы         - Структура, см. ЗарплатаКадрыОбщиеНаборыДанных.ДобавитьВКоллекциюОтбор - параметры и их значения для
//                                                                                           получения ФПД.
//  Реквизиты               - Строка, Массив          - Имена получаемых полей. Поддерживается значение "*".
//  ИмяВТ                   - Строка                  - Имя временной таблицы, по умолчанию "ВТРезультирующийПериодДействия".
//
Процедура СоздатьВТРезультирующийПериодДействия(МенеджерВременныхТаблиц, Отборы, Реквизиты,
	ИмяВТ = "ВТРезультирующийПериодДействия") Экспорт
				
	ЗарплатаКадрыОбщиеНаборыДанных.ДобавитьВКоллекциюОтбор(Отборы, "СторноТекущегоПериода", "=", Неопределено);

	РПД = ЗарплатаКадрыРасширенный.РезультирующийПериодДействия(Метаданные.РегистрыРасчета.Начисления, Отборы, Реквизиты);
		
	ЗарплатаКадры.СоздатьВТПоТаблицеЗначений(МенеджерВременныхТаблиц, РПД, ИмяВТ);
	
КонецПроцедуры

// Сторнирование движений документа исправленного в текущем периоде.
//
// Параметры:
//  НаборЗаписей         - РегистрРасчетаНаборЗаписей - Целевой набор записей в который будут добавлены сторнирующие строки.
//  ИсправленныйДокумент - ДокументСсылка             - Документ, записи которого необходимо сторнировать.
//  Записывать           - Булево                     - Если Истина, то набор будет записан сразу.
//                                                      Если Ложь, то набору будет установлен признак Записывать = Истина.
//
Процедура СторнироватьДвиженияВТекущемПериоде(НаборЗаписей, ИсправленныйДокумент, Записывать = Ложь) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	НаборИсправленный = СоздатьНаборЗаписей();
	НаборИсправленный.Отбор.Регистратор.Установить(ИсправленныйДокумент);
	НаборИсправленный.Прочитать();
	
	Если НаборИсправленный.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	МетаданныеРесурсыРегистра = Метаданные.РегистрыРасчета.Начисления.Ресурсы;
	
	Для Каждого Строка Из НаборИсправленный Цикл
		
		Если Строка.Сторно
			Или (Строка.СторноТекущегоПериода <> Неопределено И Строка.СторноТекущегоПериода <> ИсправленныйДокумент) Тогда
			Продолжить;
		КонецЕсли;
		
		// "Сторнируем" набор записей исправленного документа.
		МинусСтрока = НаборЗаписей.Добавить();
		ЗаполнитьЗначенияСвойств(МинусСтрока, Строка);
		Для Каждого Ресурс Из МетаданныеРесурсыРегистра Цикл
			МинусСтрока[Ресурс.Имя] = - МинусСтрока[Ресурс.Имя];
		КонецЦикла;
		МинусСтрока.СторноТекущегоПериода = ИсправленныйДокумент;
		МинусСтрока.СторнируемыйДокумент = ИсправленныйДокумент;
		МинусСтрока.ИдентификаторСтроки = - МинусСтрока.ИдентификаторСтроки;
		МинусСтрока.ФиксРасчет = Истина;
		
		// "Выключим" запись исправленного документа из расчета ФПД.
		Строка.СторноТекущегоПериода = ИсправленныйДокумент;
		НаборИсправленный.Записывать = Истина;
		
	КонецЦикла;
	
	Если НаборИсправленный.Записывать Тогда
		// Измененный набор записей исправленного документа будет записан перед записью целевого набора.
		// См. РегистрыРасчета.Начисления.МодульНабораЗаписей Процедура ЗаписатьНаборИсправляемыйВТекущемПериоде.
		НаборЗаписей.ДополнительныеСвойства.Вставить("НаборИсправляемыйВТекущемПериоде", НаборИсправленный);
	КонецЕсли;
	
	Если Записывать Тогда
		НаборЗаписей.Записать();
		НаборЗаписей.Записывать = Ложь;
	Иначе
		НаборЗаписей.Записывать = Истина;
	КонецЕсли;
	
КонецПроцедуры

// Используется при исправлении в текущем периоде в случае если выполнен перерасчет прошлого периода.
// В наборе записей уже могут быть сторно строки сформированные алгоритмом перерасчета, выполняется их
// преобразование в сторно строки текущего периода. Новые сторно записи не добавляются.
//
// Параметры:
//  НаборЗаписей         - РегистрРасчетаНаборЗаписей - Целевой набор записи которого будут преобразованы.
//  ИсправленныйДокумент - ДокументСсылка             - Документ, записи которого необходимо сторнировать.
//  Записывать           - Булево                     - Если Истина, то набор будет записан сразу.
//                                                      Если Ложь, то набору будет установлен признак Записывать = Истина.
//
Процедура ПреобразоватьСторноВСторноТекущегоПериода(НаборЗаписей, ИсправленныйДокумент, Записывать = Ложь) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	НаборИсправленный = СоздатьНаборЗаписей();
	НаборИсправленный.Отбор.Регистратор.Установить(ИсправленныйДокумент);
	НаборИсправленный.Прочитать();
	
	Если НаборИсправленный.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	Для Каждого Строка Из НаборИсправленный Цикл
		
		Если Строка.Сторно Или Строка.СторноТекущегоПериода <> Неопределено Тогда
			Продолжить;
		КонецЕсли;
		
		// "Выключим" запись исправленного документа из расчета ФПД.
		Строка.СторноТекущегоПериода = ИсправленныйДокумент;
		НаборИсправленный.Записывать = Истина;
		
	КонецЦикла;
	
	Для Каждого СтрокаНабора Из НаборЗаписей Цикл
		Если (СтрокаНабора.Сторно Или СтрокаНабора.ФиксСторно)
			И СтрокаНабора.СторнируемыйДокумент = ИсправленныйДокумент Тогда
			
			СтрокаНабора.Сторно = Ложь;
			СтрокаНабора.СторноТекущегоПериода = ИсправленныйДокумент;
			НаборЗаписей.Записывать = Истина;
		КонецЕсли;
	КонецЦикла;
	
	Если НаборИсправленный.Записывать Тогда
		// Измененный набор записей исправленного документа будет записан перед записью целевого набора.
		// См. РегистрыРасчета.Начисления.МодульНабораЗаписей Процедура ЗаписатьНаборИсправляемыйВТекущемПериоде.
		НаборЗаписей.ДополнительныеСвойства.Вставить("НаборИсправляемыйВТекущемПериоде", НаборИсправленный);
	КонецЕсли;
	
	Если Записывать Тогда
		НаборЗаписей.Записать();
		НаборЗаписей.Записывать = Ложь;
	Иначе
		НаборЗаписей.Записывать = Истина;
	КонецЕсли;
	
КонецПроцедуры

Процедура ПриОтменеИсправленияВТекущемПериоде(ИсправленныйДокумент) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	НаборИсправленный = СоздатьНаборЗаписей();
	НаборИсправленный.Отбор.Регистратор.Установить(ИсправленныйДокумент);
	НаборИсправленный.Прочитать();
	
	Для Каждого Строка Из НаборИсправленный Цикл
		Если Строка.СторноТекущегоПериода = ИсправленныйДокумент Тогда
			Строка.СторноТекущегоПериода = Неопределено;
			НаборИсправленный.Записывать = Истина;
		КонецЕсли;
	КонецЦикла;
	
	Если НаборИсправленный.Записывать Тогда
		НаборИсправленный.ОбменДанными.Загрузка = Истина;
		НаборИсправленный.ДополнительныеСвойства.Вставить("ОтключитьПроверкуДатыЗапретаИзменения", Истина);
		НаборИсправленный.Записать();
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура СоздатьВТПодработкиИсправленногоДокумента(Регистратор, МенеджерВременныхТаблиц)
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = МенеджерВременныхТаблиц;
	
	Сведения = ИсправлениеДокументовЗарплатаКадры.СведенияОбИсправленииДокумента(Регистратор);
	Если Сведения.ИсправленныйДокумент <> Неопределено Тогда
		
		// Все подработочные начисления исправляемого документа должны быть сторнированы
		// вне зависимости от того, какие подработки действуют на интервале регистрируемых начислений.
		// Для этого добавим сотрудников по подработочным движениям исправляемого документа.
		
		Запрос.УстановитьПараметр("ИсправленныйДокумент", Сведения.ИсправленныйДокумент);
		Запрос.Текст = 
			"ВЫБРАТЬ РАЗЛИЧНЫЕ
			|	Начисления.Сотрудник.ГоловнойСотрудник КАК Сотрудник,
			|	Начисления.Сотрудник КАК Подработка
			|ПОМЕСТИТЬ ВТПодработкиИсправленногоДокумента
			|ИЗ
			|	РегистрРасчета.Начисления КАК Начисления
			|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТКонтролируемыеНачисления КАК КонтролируемыеНачисления
			|		ПО Начисления.ВидРасчета = КонтролируемыеНачисления.ВидРасчета
			|		ЛЕВОЕ СОЕДИНЕНИЕ ВТНачисленияНабора КАК СторнирующиеНачисленияРегистратора
			|		ПО (СторнирующиеНачисленияРегистратора.ВидРасчета = Начисления.ВидРасчета)
			|			И (СторнирующиеНачисленияРегистратора.ПериодДействияНачало = Начисления.ПериодДействияНачало)
			|			И (СторнирующиеНачисленияРегистратора.ПериодДействияКонец = Начисления.ПериодДействияКонец)
			|			И (СторнирующиеНачисленияРегистратора.Сотрудник = Начисления.Сотрудник)
			|ГДЕ
			|	Начисления.Регистратор = &ИсправленныйДокумент
			|	И НЕ Начисления.Сторно
			|	И Начисления.СторноТекущегоПериода = НЕОПРЕДЕЛЕНО
			|	И СторнирующиеНачисленияРегистратора.ВидРасчета ЕСТЬ NULL";
	Иначе
		Запрос.Текст = 
			"ВЫБРАТЬ ПЕРВЫЕ 0
			|	НЕОПРЕДЕЛЕНО КАК Сотрудник,
			|	НЕОПРЕДЕЛЕНО КАК Подработка
			|ПОМЕСТИТЬ ВТПодработкиИсправленногоДокумента";
	КонецЕсли;
	
	Запрос.Выполнить();
	
КонецПроцедуры

Функция ДополнитьНаборЗаписейНачислениямиСовместителейИПодработок(НаборЗаписей, ДобавленныеЗаписи = НеОпределено) Экспорт
	
	ЗаписиДобавлялись = Ложь;
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	
	Запрос.УстановитьПараметр("НаборЗаписейНачисления", НаборЗаписей.Выгрузить());
	
	Запрос.Текст =
	"ВЫБРАТЬ
	|	Начисления.ПериодРегистрации КАК ПериодРегистрации,
	|	Начисления.Регистратор КАК Регистратор,
	|	Начисления.НомерСтроки КАК НомерСтроки,
	|	Начисления.ВидРасчета КАК ВидРасчета,
	|	Начисления.ПериодДействия КАК ПериодДействия,
	|	Начисления.ПериодДействияНачало КАК ПериодДействияНачало,
	|	Начисления.ПериодДействияКонец КАК ПериодДействияКонец,
	|	Начисления.БазовыйПериодНачало КАК БазовыйПериодНачало,
	|	Начисления.БазовыйПериодКонец КАК БазовыйПериодКонец,
	|	Начисления.Активность КАК Активность,
	|	Начисления.Сторно КАК Сторно,
	|	Начисления.СторноТекущегоПериода КАК СторноТекущегоПериода,
	|	Начисления.Сотрудник КАК Сотрудник,
	|	Начисления.ФизическоеЛицо КАК ФизическоеЛицо,
	|	Начисления.ГоловнаяОрганизация КАК ГоловнаяОрганизация,
	|	Начисления.Результат КАК Результат,
	|	Начисления.ОтработаноДней КАК ОтработаноДней,
	|	Начисления.ОтработаноЧасов КАК ОтработаноЧасов,
	|	Начисления.РезультатВТомЧислеЗаСчетФБ КАК РезультатВТомЧислеЗаСчетФБ,
	|	Начисления.ГрафикРаботы КАК ГрафикРаботы,
	|	Начисления.ВидУчетаВремени КАК ВидУчетаВремени,
	|	Начисления.ВремяВЧасах КАК ВремяВЧасах,
	|	Начисления.ГрафикРаботыНорма КАК ГрафикРаботыНорма,
	|	Начисления.ВремяВЦеломЗаПериод КАК ВремяВЦеломЗаПериод,
	|	Начисления.ОбщийГрафик КАК ОбщийГрафик,
	|	Начисления.Организация КАК Организация,
	|	Начисления.ФиксСтрока КАК ФиксСтрока,
	|	Начисления.ФиксЗаполнение КАК ФиксЗаполнение,
	|	Начисления.ФиксРасчетВремени КАК ФиксРасчетВремени,
	|	Начисления.ФиксРасчет КАК ФиксРасчет,
	|	Начисления.РасчетнаяБазаЗаЕдиницуНормыВремени КАК РасчетнаяБазаЗаЕдиницуНормыВремени,
	|	Начисления.ИдентификаторСтроки КАК ИдентификаторСтроки,
	|	Начисления.ПериодРегистрацииВремени КАК ПериодРегистрацииВремени,
	|	Начисления.ПериодРегистрацииНормыВремени КАК ПериодРегистрацииНормыВремени,
	|	Начисления.ДоляРезультата КАК ДоляРезультата,
	|	Начисления.ДокументОснование КАК ДокументОснование
	|ПОМЕСТИТЬ ВТВсеНачисленияНабора
	|ИЗ
	|	&НаборЗаписейНачисления КАК Начисления
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Начисления.Ссылка КАК ВидРасчета
	|ПОМЕСТИТЬ ВТКонтролируемыеНачисления
	|ИЗ
	|	ПланВидовРасчета.Начисления КАК Начисления
	|ГДЕ
	|	(Начисления.ДублироватьДляВнутреннихСовместителейИПодработок
	|			ИЛИ Начисления.ДублироватьДляПодработок)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Начисления.ПериодРегистрации КАК ПериодРегистрации,
	|	Начисления.Регистратор КАК Регистратор,
	|	Начисления.НомерСтроки КАК НомерСтроки,
	|	Начисления.ВидРасчета КАК ВидРасчета,
	|	Начисления.ПериодДействия КАК ПериодДействия,
	|	Начисления.ПериодДействияНачало КАК ПериодДействияНачало,
	|	Начисления.ПериодДействияКонец КАК ПериодДействияКонец,
	|	Начисления.БазовыйПериодНачало КАК БазовыйПериодНачало,
	|	Начисления.БазовыйПериодКонец КАК БазовыйПериодКонец,
	|	Начисления.Активность КАК Активность,
	|	Начисления.Сторно КАК Сторно,
	|	Начисления.СторноТекущегоПериода КАК СторноТекущегоПериода,
	|	Начисления.Сотрудник КАК Сотрудник,
	|	Начисления.ФизическоеЛицо КАК ФизическоеЛицо,
	|	Начисления.ГоловнаяОрганизация КАК ГоловнаяОрганизация,
	|	Начисления.Результат КАК Результат,
	|	Начисления.ОтработаноДней КАК ОтработаноДней,
	|	Начисления.ОтработаноЧасов КАК ОтработаноЧасов,
	|	Начисления.РезультатВТомЧислеЗаСчетФБ КАК РезультатВТомЧислеЗаСчетФБ,
	|	Начисления.ГрафикРаботы КАК ГрафикРаботы,
	|	Начисления.ВидУчетаВремени КАК ВидУчетаВремени,
	|	Начисления.ВремяВЧасах КАК ВремяВЧасах,
	|	Начисления.ГрафикРаботыНорма КАК ГрафикРаботыНорма,
	|	Начисления.ВремяВЦеломЗаПериод КАК ВремяВЦеломЗаПериод,
	|	Начисления.ОбщийГрафик КАК ОбщийГрафик,
	|	Начисления.Организация КАК Организация,
	|	Начисления.ФиксСтрока КАК ФиксСтрока,
	|	Начисления.ФиксЗаполнение КАК ФиксЗаполнение,
	|	Начисления.ФиксРасчетВремени КАК ФиксРасчетВремени,
	|	Начисления.ФиксРасчет КАК ФиксРасчет,
	|	Начисления.РасчетнаяБазаЗаЕдиницуНормыВремени КАК РасчетнаяБазаЗаЕдиницуНормыВремени,
	|	Начисления.ИдентификаторСтроки КАК ИдентификаторСтроки,
	|	Начисления.ПериодРегистрацииВремени КАК ПериодРегистрацииВремени,
	|	Начисления.ПериодРегистрацииНормыВремени КАК ПериодРегистрацииНормыВремени,
	|	Начисления.ДоляРезультата КАК ДоляРезультата,
	|	Начисления.ДокументОснование КАК ДокументОснование
	|ПОМЕСТИТЬ ВТНачисленияНабора
	|ИЗ
	|	ВТВсеНачисленияНабора КАК Начисления
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТКонтролируемыеНачисления КАК КонтролируемыеНачисления
	|		ПО Начисления.ВидРасчета = КонтролируемыеНачисления.ВидРасчета
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	МИНИМУМ(НачисленияНабора.ПериодДействияНачало) КАК НачалоПериода,
	|	МАКСИМУМ(НачисленияНабора.ПериодДействияКонец) КАК ОкончаниеПериода,
	|	НачисленияНабора.Организация КАК Организация
	|ИЗ
	|	ВТНачисленияНабора КАК НачисленияНабора
	|ГДЕ
	|	НачисленияНабора.Сотрудник = ВЫРАЗИТЬ(НачисленияНабора.Сотрудник КАК Справочник.Сотрудники).ГоловнойСотрудник
	|
	|СГРУППИРОВАТЬ ПО
	|	НачисленияНабора.Организация";
	
	РезультатЗапроса = Запрос.Выполнить();
	Если Не РезультатЗапроса.Пустой() Тогда
		
		СоздатьВТПодработкиИсправленногоДокумента(НаборЗаписей.Отбор.Регистратор.Значение, Запрос.МенеджерВременныхТаблиц);
		
		УдалитьВременныеТаблицы = Ложь;
		ВыборкаПериодов = РезультатЗапроса.Выбрать();
		Пока ВыборкаПериодов.Следующий() Цикл
			
			ЧастиЗапроса = Новый Массив;
			
			Если УдалитьВременныеТаблицы Тогда
				ЧастиЗапроса.Добавить("УНИЧТОЖИТЬ ВТФизическиеЛица");
				ЧастиЗапроса.Добавить("УНИЧТОЖИТЬ ВТСотрудникиОрганизации");
				ЧастиЗапроса.Добавить("УНИЧТОЖИТЬ ВТСотрудникиССовместителями");
				ЧастиЗапроса.Добавить("УНИЧТОЖИТЬ ВТНачисленияНабораСНачислениямиСовместителей");
				ЧастиЗапроса.Добавить("УНИЧТОЖИТЬ ВТСотрудникиСПодработками");
			Иначе
				УдалитьВременныеТаблицы = Истина;
			КонецЕсли;
			
			ЧастиЗапроса.Добавить(
				"ВЫБРАТЬ РАЗЛИЧНЫЕ
				|	НачисленияНабора.ФизическоеЛицо
				|ПОМЕСТИТЬ ВТФизическиеЛица
				|ИЗ
				|	ВТНачисленияНабора КАК НачисленияНабора
				|ГДЕ
				|	НачисленияНабора.Сотрудник = НачисленияНабора.Сотрудник.ГоловнойСотрудник");
			
			Запрос.Текст = СтрСоединить(ЧастиЗапроса, ОбщегоНазначения.РазделительПакетаЗапросов());
			Запрос.УстановитьПараметр("Организация", ВыборкаПериодов.Организация);
			Запрос.Выполнить();
			
			ПараметрыПолучения = КадровыйУчет.ПараметрыПолученияСотрудниковОрганизацийПоВременнойТаблице();
			ЗаполнитьЗначенияСвойств(ПараметрыПолучения, ВыборкаПериодов);
			ПараметрыПолучения.КадровыеДанные = "ВидЗанятости,ГоловнойСотрудник";
			ПараметрыПолучения.ОтбиратьПоГоловнойОрганизации = Истина;
			ПараметрыПолучения.ПодработкиРаботниковПоТрудовымДоговорам = Истина;
			
			КадровыйУчет.СоздатьВТСотрудникиОрганизации(Запрос.МенеджерВременныхТаблиц, Ложь, ПараметрыПолучения);
			
			// Дублирование начислений внутренних совместителей.
			Запрос.Текст =
			"ВЫБРАТЬ
			|	СотрудникиОрганизации.Сотрудник КАК Сотрудник,
			|	СотрудникиОрганизацииСовместители.Сотрудник КАК Совместитель
			|ПОМЕСТИТЬ ВТСотрудникиССовместителями
			|ИЗ
			|	ВТСотрудникиОрганизации КАК СотрудникиОрганизации
			|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТСотрудникиОрганизации КАК СотрудникиОрганизацииСовместители
			|		ПО СотрудникиОрганизации.ФизическоеЛицо = СотрудникиОрганизацииСовместители.ФизическоеЛицо
			|			И (СотрудникиОрганизацииСовместители.ВидЗанятости = ЗНАЧЕНИЕ(Перечисление.ВидыЗанятости.ВнутреннееСовместительство))
			|ГДЕ
			|	СотрудникиОрганизации.ВидЗанятости В (ЗНАЧЕНИЕ(Перечисление.ВидыЗанятости.ОсновноеМестоРаботы), ЗНАЧЕНИЕ(Перечисление.ВидыЗанятости.Совместительство))
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ
			|	НачисленияНабора.ПериодРегистрации КАК ПериодРегистрации,
			|	НачисленияНабора.Регистратор КАК Регистратор,
			|	НачисленияНабора.НомерСтроки КАК НомерСтроки,
			|	НачисленияНабора.ВидРасчета КАК ВидРасчета,
			|	НачисленияНабора.ПериодДействия КАК ПериодДействия,
			|	НачисленияНабора.ПериодДействияНачало КАК ПериодДействияНачало,
			|	НачисленияНабора.ПериодДействияКонец КАК ПериодДействияКонец,
			|	НачисленияНабора.БазовыйПериодНачало КАК БазовыйПериодНачало,
			|	НачисленияНабора.БазовыйПериодКонец КАК БазовыйПериодКонец,
			|	НачисленияНабора.Активность КАК Активность,
			|	НачисленияНабора.Сторно КАК Сторно,
			|	НачисленияНабора.СторноТекущегоПериода КАК СторноТекущегоПериода,
			|	НачисленияНабора.Сотрудник КАК Сотрудник,
			|	НачисленияНабора.ФизическоеЛицо КАК ФизическоеЛицо,
			|	НачисленияНабора.ГоловнаяОрганизация КАК ГоловнаяОрганизация,
			|	НачисленияНабора.Результат КАК Результат,
			|	НачисленияНабора.ОтработаноДней КАК ОтработаноДней,
			|	НачисленияНабора.ОтработаноЧасов КАК ОтработаноЧасов,
			|	НачисленияНабора.РезультатВТомЧислеЗаСчетФБ КАК РезультатВТомЧислеЗаСчетФБ,
			|	НачисленияНабора.ГрафикРаботы КАК ГрафикРаботы,
			|	НачисленияНабора.ВидУчетаВремени КАК ВидУчетаВремени,
			|	НачисленияНабора.ВремяВЧасах КАК ВремяВЧасах,
			|	НачисленияНабора.ГрафикРаботыНорма КАК ГрафикРаботыНорма,
			|	НачисленияНабора.ВремяВЦеломЗаПериод КАК ВремяВЦеломЗаПериод,
			|	НачисленияНабора.ОбщийГрафик КАК ОбщийГрафик,
			|	НачисленияНабора.Организация КАК Организация,
			|	НачисленияНабора.ФиксСтрока КАК ФиксСтрока,
			|	НачисленияНабора.ФиксЗаполнение КАК ФиксЗаполнение,
			|	НачисленияНабора.ФиксРасчетВремени КАК ФиксРасчетВремени,
			|	НачисленияНабора.ФиксРасчет КАК ФиксРасчет,
			|	НачисленияНабора.РасчетнаяБазаЗаЕдиницуНормыВремени КАК РасчетнаяБазаЗаЕдиницуНормыВремени,
			|	НачисленияНабора.ИдентификаторСтроки КАК ИдентификаторСтроки,
			|	НачисленияНабора.ПериодРегистрацииВремени КАК ПериодРегистрацииВремени,
			|	НачисленияНабора.ПериодРегистрацииНормыВремени КАК ПериодРегистрацииНормыВремени,
			|	НачисленияНабора.ДоляРезультата КАК ДоляРезультата,
			|	НачисленияНабора.ДокументОснование КАК ДокументОснование,
			|	ЛОЖЬ КАК ДобавленноеНачислениеНабора
			|ПОМЕСТИТЬ ВТНачисленияНабораСНачислениямиСовместителей
			|ИЗ
			|	ВТНачисленияНабора КАК НачисленияНабора
			|
			|ОБЪЕДИНИТЬ ВСЕ
			|
			|ВЫБРАТЬ
			|	НачисленияНабора.ПериодРегистрации,
			|	НачисленияНабора.Регистратор,
			|	НачисленияНабора.НомерСтроки,
			|	НачисленияНабора.ВидРасчета,
			|	НачисленияНабора.ПериодДействия,
			|	НачисленияНабора.ПериодДействияНачало,
			|	НачисленияНабора.ПериодДействияКонец,
			|	НачисленияНабора.БазовыйПериодНачало,
			|	НачисленияНабора.БазовыйПериодКонец,
			|	НачисленияНабора.Активность,
			|	НачисленияНабора.Сторно,
			|	НачисленияНабора.СторноТекущегоПериода,
			|	СотрудникиССовместителями.Совместитель,
			|	НачисленияНабора.ФизическоеЛицо,
			|	НачисленияНабора.ГоловнаяОрганизация,
			|	НачисленияНабора.Результат,
			|	НачисленияНабора.ОтработаноДней,
			|	НачисленияНабора.ОтработаноЧасов,
			|	НачисленияНабора.РезультатВТомЧислеЗаСчетФБ,
			|	НачисленияНабора.ГрафикРаботы,
			|	НачисленияНабора.ВидУчетаВремени,
			|	НачисленияНабора.ВремяВЧасах,
			|	НачисленияНабора.ГрафикРаботыНорма,
			|	НачисленияНабора.ВремяВЦеломЗаПериод,
			|	НачисленияНабора.ОбщийГрафик,
			|	НачисленияНабора.Организация,
			|	НачисленияНабора.ФиксСтрока,
			|	НачисленияНабора.ФиксЗаполнение,
			|	НачисленияНабора.ФиксРасчетВремени,
			|	НачисленияНабора.ФиксРасчет,
			|	НачисленияНабора.РасчетнаяБазаЗаЕдиницуНормыВремени,
			|	НачисленияНабора.ИдентификаторСтроки,
			|	НачисленияНабора.ПериодРегистрацииВремени,
			|	НачисленияНабора.ПериодРегистрацииНормыВремени,
			|	НачисленияНабора.ДоляРезультата,
			|	НачисленияНабора.ДокументОснование,
			|	ИСТИНА
			|ИЗ
			|	ВТСотрудникиССовместителями КАК СотрудникиССовместителями
			|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТНачисленияНабора КАК НачисленияНабора
			|		ПО СотрудникиССовместителями.Сотрудник = НачисленияНабора.Сотрудник
			|		ЛЕВОЕ СОЕДИНЕНИЕ ВТНачисленияНабора КАК НачисленияНабораСовместителей
			|		ПО СотрудникиССовместителями.Совместитель = НачисленияНабораСовместителей.Сотрудник
			|			И (НачисленияНабора.ВидРасчета = НачисленияНабораСовместителей.ВидРасчета)
			|			И (НачисленияНабора.ПериодДействияНачало = НачисленияНабораСовместителей.ПериодДействияНачало)
			|			И (НачисленияНабора.ПериодДействияКонец = НачисленияНабораСовместителей.ПериодДействияКонец)
			|ГДЕ
			|	НачисленияНабораСовместителей.Сотрудник ЕСТЬ NULL
			|	И ВЫРАЗИТЬ(НачисленияНабора.ВидРасчета КАК ПланВидовРасчета.Начисления).ДублироватьДляВнутреннихСовместителейИПодработок
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ
			|	НачисленияНабораСНачислениямиСовместителей.ПериодРегистрации КАК ПериодРегистрации,
			|	НачисленияНабораСНачислениямиСовместителей.Регистратор КАК Регистратор,
			|	НачисленияНабораСНачислениямиСовместителей.НомерСтроки КАК НомерСтроки,
			|	НачисленияНабораСНачислениямиСовместителей.ВидРасчета КАК ВидРасчета,
			|	НачисленияНабораСНачислениямиСовместителей.ПериодДействия КАК ПериодДействия,
			|	НачисленияНабораСНачислениямиСовместителей.ПериодДействияНачало КАК ПериодДействияНачало,
			|	НачисленияНабораСНачислениямиСовместителей.ПериодДействияКонец КАК ПериодДействияКонец,
			|	НачисленияНабораСНачислениямиСовместителей.БазовыйПериодНачало КАК БазовыйПериодНачало,
			|	НачисленияНабораСНачислениямиСовместителей.БазовыйПериодКонец КАК БазовыйПериодКонец,
			|	НачисленияНабораСНачислениямиСовместителей.Активность КАК Активность,
			|	НачисленияНабораСНачислениямиСовместителей.Сторно КАК Сторно,
			|	НачисленияНабораСНачислениямиСовместителей.Сотрудник КАК Сотрудник,
			|	НачисленияНабораСНачислениямиСовместителей.ФизическоеЛицо КАК ФизическоеЛицо,
			|	НачисленияНабораСНачислениямиСовместителей.ГоловнаяОрганизация КАК ГоловнаяОрганизация,
			|	0 КАК Результат,
			|	0 КАК ОтработаноДней,
			|	0 КАК ОтработаноЧасов,
			|	0 КАК РезультатВТомЧислеЗаСчетФБ,
			|	НачисленияНабораСНачислениямиСовместителей.ГрафикРаботы КАК ГрафикРаботы,
			|	НачисленияНабораСНачислениямиСовместителей.ВидУчетаВремени КАК ВидУчетаВремени,
			|	НачисленияНабораСНачислениямиСовместителей.ВремяВЧасах КАК ВремяВЧасах,
			|	НачисленияНабораСНачислениямиСовместителей.ГрафикРаботыНорма КАК ГрафикРаботыНорма,
			|	НачисленияНабораСНачислениямиСовместителей.ВремяВЦеломЗаПериод КАК ВремяВЦеломЗаПериод,
			|	НачисленияНабораСНачислениямиСовместителей.Организация КАК Организация,
			|	НачисленияНабораСНачислениямиСовместителей.ФиксСтрока КАК ФиксСтрока,
			|	НачисленияНабораСНачислениямиСовместителей.ФиксЗаполнение КАК ФиксЗаполнение,
			|	НачисленияНабораСНачислениямиСовместителей.ФиксРасчетВремени КАК ФиксРасчетВремени,
			|	НачисленияНабораСНачислениямиСовместителей.ФиксРасчет КАК ФиксРасчет,
			|	НачисленияНабораСНачислениямиСовместителей.РасчетнаяБазаЗаЕдиницуНормыВремени КАК РасчетнаяБазаЗаЕдиницуНормыВремени,
			|	НачисленияНабораСНачислениямиСовместителей.ИдентификаторСтроки КАК ИдентификаторСтроки,
			|	НачисленияНабораСНачислениямиСовместителей.ПериодРегистрацииВремени КАК ПериодРегистрацииВремени,
			|	НачисленияНабораСНачислениямиСовместителей.ДоляРезультата КАК ДоляРезультата,
			|	НачисленияНабораСНачислениямиСовместителей.ДокументОснование КАК ДокументОснование
			|ИЗ
			|	ВТНачисленияНабораСНачислениямиСовместителей КАК НачисленияНабораСНачислениямиСовместителей
			|ГДЕ
			|	НачисленияНабораСНачислениямиСовместителей.ДобавленноеНачислениеНабора";
				
			Выборка = Запрос.Выполнить().Выбрать();
			Пока Выборка.Следующий() Цикл
				ЗаписиДобавлялись = Истина;
				НоваяЗапись = НаборЗаписей.Добавить();
				ЗаполнитьЗначенияСвойств(НоваяЗапись, Выборка);
				// Записи с нулевыми идентификаторами - "технические" записи подработок и внутренних совместителей.
				НоваяЗапись.ИдентификаторСтроки = 0;
				Если ДобавленныеЗаписи <> НеОпределено Тогда
					ДобавленныеЗаписи.Добавить(НоваяЗапись);
				КонецЕсли;
			КонецЦикла;
			
			// Дублирование начислений внутренних подработок.
			Запрос.Текст =
			"ВЫБРАТЬ
			|	Сотрудники.Сотрудник КАК Сотрудник,
			|	Сотрудники.Подработка КАК Подработка,
			|	МИНИМУМ(Сотрудники.ТолькоДляСторно) КАК ТолькоДляСторно
			|ПОМЕСТИТЬ ВТСотрудникиСПодработками
			|ИЗ
			|	(ВЫБРАТЬ
			|		СотрудникиОрганизации.Сотрудник КАК Сотрудник,
			|		СотрудникиОрганизацииПодработки.Сотрудник КАК Подработка,
			|		ЛОЖЬ КАК ТолькоДляСторно
			|	ИЗ
			|		ВТСотрудникиОрганизации КАК СотрудникиОрганизации
			|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТСотрудникиОрганизации КАК СотрудникиОрганизацииПодработки
			|			ПО СотрудникиОрганизации.ФизическоеЛицо = СотрудникиОрганизацииПодработки.ФизическоеЛицо
			|				И СотрудникиОрганизации.Сотрудник = СотрудникиОрганизацииПодработки.ГоловнойСотрудник
			|				И (СотрудникиОрганизацииПодработки.ВидЗанятости = ЗНАЧЕНИЕ(Перечисление.ВидыЗанятости.Подработка))
			|	ГДЕ
			|		СотрудникиОрганизации.ВидЗанятости <> ЗНАЧЕНИЕ(Перечисление.ВидыЗанятости.Подработка)
			|	
			|	ОБЪЕДИНИТЬ ВСЕ
			|	
			|	ВЫБРАТЬ
			|		ПодработкиИсправленногоДокумента.Сотрудник,
			|		ПодработкиИсправленногоДокумента.Подработка,
			|		ИСТИНА
			|	ИЗ
			|		ВТПодработкиИсправленногоДокумента КАК ПодработкиИсправленногоДокумента) КАК Сотрудники
			|
			|СГРУППИРОВАТЬ ПО
			|	Сотрудники.Сотрудник,
			|	Сотрудники.Подработка
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ
			|	НачисленияНабора.ПериодРегистрации КАК ПериодРегистрации,
			|	НачисленияНабора.Регистратор КАК Регистратор,
			|	НачисленияНабора.НомерСтроки КАК НомерСтроки,
			|	НачисленияНабора.ВидРасчета КАК ВидРасчета,
			|	НачисленияНабора.ПериодДействия КАК ПериодДействия,
			|	НачисленияНабора.ПериодДействияНачало КАК ПериодДействияНачало,
			|	НачисленияНабора.ПериодДействияКонец КАК ПериодДействияКонец,
			|	НачисленияНабора.БазовыйПериодНачало КАК БазовыйПериодНачало,
			|	НачисленияНабора.БазовыйПериодКонец КАК БазовыйПериодКонец,
			|	НачисленияНабора.Активность КАК Активность,
			|	НачисленияНабора.Сторно КАК Сторно,
			|	НачисленияНабора.СторноТекущегоПериода КАК СторноТекущегоПериода,
			|	СотрудникиСПодработками.Подработка КАК Сотрудник,
			|	НачисленияНабора.ФизическоеЛицо КАК ФизическоеЛицо,
			|	НачисленияНабора.ГоловнаяОрганизация КАК ГоловнаяОрганизация,
			|	0 КАК Результат,
			|	0 КАК ОтработаноДней,
			|	0 КАК ОтработаноЧасов,
			|	0 КАК РезультатВТомЧислеЗаСчетФБ,
			|	НачисленияНабора.ГрафикРаботы КАК ГрафикРаботы,
			|	НачисленияНабора.ВидУчетаВремени КАК ВидУчетаВремени,
			|	НачисленияНабора.ВремяВЧасах КАК ВремяВЧасах,
			|	НачисленияНабора.ГрафикРаботыНорма КАК ГрафикРаботыНорма,
			|	НачисленияНабора.ВремяВЦеломЗаПериод КАК ВремяВЦеломЗаПериод,
			|	НачисленияНабора.ОбщийГрафик КАК ОбщийГрафик,
			|	НачисленияНабора.Организация КАК Организация,
			|	НачисленияНабора.ФиксСтрока КАК ФиксСтрока,
			|	НачисленияНабора.ФиксЗаполнение КАК ФиксЗаполнение,
			|	НачисленияНабора.ФиксРасчетВремени КАК ФиксРасчетВремени,
			|	НачисленияНабора.ФиксРасчет КАК ФиксРасчет,
			|	НачисленияНабора.РасчетнаяБазаЗаЕдиницуНормыВремени КАК РасчетнаяБазаЗаЕдиницуНормыВремени,
			|	НачисленияНабора.ИдентификаторСтроки КАК ИдентификаторСтроки,
			|	НачисленияНабора.ПериодРегистрацииВремени КАК ПериодРегистрацииВремени,
			|	НачисленияНабора.ПериодРегистрацииНормыВремени КАК ПериодРегистрацииНормыВремени,
			|	НачисленияНабора.ДоляРезультата КАК ДоляРезультата,
			|	НачисленияНабора.ДокументОснование КАК ДокументОснование
			|ИЗ
			|	ВТСотрудникиСПодработками КАК СотрудникиСПодработками
			|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТНачисленияНабораСНачислениямиСовместителей КАК НачисленияНабора
			|		ПО СотрудникиСПодработками.Сотрудник = НачисленияНабора.Сотрудник
			|			И (ВЫБОР
			|				КОГДА СотрудникиСПодработками.ТолькоДляСторно
			|					ТОГДА НачисленияНабора.Сторно
			|				ИНАЧЕ ИСТИНА
			|			КОНЕЦ)
			|		ЛЕВОЕ СОЕДИНЕНИЕ ВТНачисленияНабораСНачислениямиСовместителей КАК НачисленияНабораГоловныхСотрудников
			|		ПО СотрудникиСПодработками.Подработка = НачисленияНабораГоловныхСотрудников.Сотрудник
			|			И (НачисленияНабора.ВидРасчета = НачисленияНабораГоловныхСотрудников.ВидРасчета)
			|			И (НачисленияНабора.ПериодДействияНачало = НачисленияНабораГоловныхСотрудников.ПериодДействияНачало)
			|			И (НачисленияНабора.ПериодДействияКонец = НачисленияНабораГоловныхСотрудников.ПериодДействияКонец)
			|ГДЕ
			|	НачисленияНабораГоловныхСотрудников.Сотрудник ЕСТЬ NULL";
			
			Выборка = Запрос.Выполнить().Выбрать();
			Пока Выборка.Следующий() Цикл
				ЗаписиДобавлялись = Истина;
				НоваяЗапись = НаборЗаписей.Добавить();
				ЗаполнитьЗначенияСвойств(НоваяЗапись, Выборка);
				// Записи с нулевыми идентификаторами - "технические" записи подработок и внутренних совместителей.
				НоваяЗапись.ИдентификаторСтроки = 0;
				Если ДобавленныеЗаписи <> НеОпределено Тогда
					ДобавленныеЗаписи.Добавить(НоваяЗапись);
				КонецЕсли;
			КонецЦикла;
			
		КонецЦикла;
		
	КонецЕсли;
		
	Возврат ЗаписиДобавлялись;
	
КонецФункции

Функция ЕстьДвиженияПоРегистратору(Регистратор) Экспорт 
	Если Не ЗначениеЗаполнено(Регистратор) Тогда
		Возврат Ложь;
	КонецЕсли;	
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Регистратор", Регистратор);
	Запрос.Текст = 
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	ИСТИНА КАК Поле1
	|ИЗ
	|	РегистрРасчета.Начисления КАК Начисления
	|ГДЕ
	|	Начисления.Регистратор = &Регистратор";
	
	Возврат Не Запрос.Выполнить().Пустой();
КонецФункции	

#КонецОбласти

#КонецЕсли
